In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
url='https://drive.google.com/file/d/19xU_YQ3m0nmP7EmpQIaup28HIm_y3Aic/view?usp=drivesdk'
path = 'https://drive.google.com/uc?export=download&id='+url.split('/')[-2]
df = pd.read_csv(path)

In [3]:
df.head()

,City,Date,PM2.5,PM10,NO,NO2,NOx,NH3,CO,SO2,O3,C6H6,C7H8,C8H10,AQI,AQI_Bucket
0,Ahmedabad,1/1/2015,NaN,NaN,0.92,18.22,17.15,NaN,0.92,27.64,133.36,0.00,0.02,0.00,NaN,NaN
1,Ahmedabad,1/2/2015,NaN,NaN,0.97,15.69,16.46,NaN,0.97,24.55,34.06,3.68,5.50,3.77,NaN,NaN
2,Ahmedabad,1/3/2015,NaN,NaN,17.40,19.30,29.70,NaN,17.40,29.07,30.70,6.80,16.40,2.25,NaN,NaN
3,Ahmedabad,1/4/2015,NaN,NaN,1.70,18.48,17.97,NaN,1.70,18.59,36.08,4.43,10.14,1.00,NaN,NaN
4,Ahmedabad,1/5/2015,NaN,NaN,22.10,21.42,37.76,NaN,22.10,39.33,39.31,7.01,18.89,2.78,NaN,NaN

In [4]:
df.isnull().sum(axis = 0)

City              0
Date              0
PM2.5          4598
PM10          11140
NO             3582
NO2            3585
NOx            4185
NH3           10328
CO             2059
SO2            3854
O3             4022
C6H6           5623
C7H8           8041
C8H10         18109
AQI            4681
AQI_Bucket     4681
dtype: int64

In [5]:
#df.dtypes

In [6]:
df.shape

(29531, 16)

In [7]:
df.ndim

2

In [8]:
df.columns

Index(['City', 'Date', 'PM2.5', 'PM10', 'NO', 'NO2', 'NOx', 'NH3', 'CO', 'SO2',
       'O3', 'C6H6', 'C7H8', 'C8H10', 'AQI', 'AQI_Bucket'],
      dtype='object')

## Converted data types relevant to column name

In [9]:
df['Date'] =  pd.to_datetime(df['Date'], infer_datetime_format=True)

In [10]:
df.dtypes

City                  object
Date          datetime64[ns]
PM2.5                float64
PM10                 float64
NO                   float64
NO2                  float64
NOx                  float64
NH3                  float64
CO                   float64
SO2                  float64
O3                   float64
C6H6                 float64
C7H8                 float64
C8H10                float64
AQI                  float64
AQI_Bucket            object
dtype: object

## Dropping all null values and making a new DF

In [11]:
df_2=df.dropna(axis=0)

In [12]:
df.isnull().sum(axis=0)

City              0
Date              0
PM2.5          4598
PM10          11140
NO             3582
NO2            3585
NOx            4185
NH3           10328
CO             2059
SO2            3854
O3             4022
C6H6           5623
C7H8           8041
C8H10         18109
AQI            4681
AQI_Bucket     4681
dtype: int64

In [13]:
df_2.isnull().sum(axis=0)

City          0
Date          0
PM2.5         0
PM10          0
NO            0
NO2           0
NOx           0
NH3           0
CO            0
SO2           0
O3            0
C6H6          0
C7H8          0
C8H10         0
AQI           0
AQI_Bucket    0
dtype: int64

In [14]:
#print(df[df.columns[2:-1]].min(),df[df.columns[2:-1]].max() , sep = "\n")

## Printing the max and min value of all Columns

In [16]:
df_3=df[df.columns[2:-1]]
df_3.head()
for column in df_3:
    print(column+"   -" ,df_3[column].min(),df_3[column].max(),sep="     " )

PM2.5   -     0.04     949.99
PM10   -     0.01     1000.0
NO   -     0.02     390.68
NO2   -     0.01     362.21
NOx   -     0.0     467.63
NH3   -     0.01     352.89
CO   -     0.0     175.81
SO2   -     0.01     193.86
O3   -     0.01     257.73
C6H6   -     0.0     455.03
C7H8   -     0.0     454.85
C8H10   -     0.0     170.37
AQI   -     13.0     2049.0

### Replacing the Null values in all columns having float data type by thier mean.

In [17]:
X = df_3.iloc[:, :].values

from sklearn.impute import SimpleImputer
imputer = SimpleImputer(missing_values=np.nan, strategy='mean')
imputer = imputer.fit(X[:, :])
X[:, :] = imputer.transform(X[:, :])

In [18]:
type(X)

numpy.ndarray

In [19]:
X_df = pd.DataFrame(X, columns = [column for column in df_3])

In [20]:
X_df.head()

,PM2.5,PM10,NO,NO2,NOx,NH3,CO,SO2,O3,C6H6,C7H8,C8H10,AQI
0,67.450578,118.127103,0.92,18.22,17.15,23.483476,0.92,27.64,133.36,0.00,0.02,0.00,166.463581
1,67.450578,118.127103,0.97,15.69,16.46,23.483476,0.97,24.55,34.06,3.68,5.50,3.77,166.463581
2,67.450578,118.127103,17.40,19.30,29.70,23.483476,17.40,29.07,30.70,6.80,16.40,2.25,166.463581
3,67.450578,118.127103,1.70,18.48,17.97,23.483476,1.70,18.59,36.08,4.43,10.14,1.00,166.463581
4,67.450578,118.127103,22.10,21.42,37.76,23.483476,22.10,39.33,39.31,7.01,18.89,2.78,166.463581